[
  {
    "name": "Pisces",
    "image": [
      "pisces-1.jpg",
      "pisces-2.jpg"
    ],
    "nameLetter": [
      "D",
      "CH",
      "Z",
      "TH"
    ],
    "specialQuality": "Intuitive Dreamer",
    "startDate": "February 19",
    "endDate": "March 20",
    "positives": {
      "1": "Pisces individuals are highly empathetic. They can intuitively understand and connect with the emotions of others.",
      "2": "Many Pisceans possess a strong creative streak. They excel in artistic and imaginative pursuits, expressing themselves through various mediums.",
      "3": "Pisces values compassion and kindness. They're often the ones who go out of their way to help those in need.",
      "4": "Pisces has a strong intuitive sense. They can pick up on subtle energies and have a knack for understanding things beyond the surface.",
      "5": "Pisces often has a deep spiritual connection. They're drawn to matters of the soul and are open to exploring spiritual and mystical realms."
    },
    "negatives": {
      "1": "Pisces can be highly sensitive, which can sometimes make them susceptible to being overwhelmed by emotions or external influences.",
      "2": "Due to their sensitivity, Pisces individuals might sometimes resort to escapism, using various methods to avoid facing reality.",
      "3": "Pisces' dual nature can lead to indecision, as they may struggle to choose between conflicting options or emotions.",
      "4": "Pisces might have difficulty setting and maintaining boundaries, often sacrificing their own needs for the sake of others.",
      "5": "While their idealism can be a strength, it can sometimes lead to unrealistic expectations or disappointments when reality falls short."
    },
    "description": "Pisces is the twelfth sign of the zodiac, symbolized by the Fish. People born between February 19 and March 20 fall under this sign. Pisces is a Water sign, and it is traditionally ruled by Jupiter (traditional ruler) and Neptune (modern ruler), giving Pisces a deep sense of intuition, creativity, and sensitivity."
  },
  {
    "name": "Aquarius",
    "image": [
      "aquarius-1.jpg",
      "aquarius-2.jpg"
    ],
    "nameLetter": [
      "G",
      "S",
      "Sh"
    ],
    "specialQuality": "Innovative Visionary",
    "startDate": "January 20",
    "endDate": "February 18",
    "positives": {
      "1": "Aquarius individuals are highly original thinkers. They often have unique ideas and enjoy expressing their creativity in innovative ways.",
      "2": "Aquarius values equality and social justice. They're often drawn to causes that promote the well-being of humanity.",
      "3": "Many Aquarians have a strong intellect. They enjoy intellectual pursuits, engaging in meaningful conversations, and exploring new ideas.",
      "4": "Aquarius values independence and freedom. They often have a unique way of viewing the world and prefer to carve their own path.",
      "5": "Aquarius is open to new perspectives and ideas. They're usually non-conformist, willing to question norms and challenge the status quo."
    },
    "negatives": {
      "1": "Aquarius can sometimes come across as emotionally distant or detached, especially when they're focused on abstract ideas or causes.",
      "2": "While their non-conformist nature is a strength, it can sometimes lead to unnecessary rebellion or contrarian behavior.",
      "3": "Aquarius individuals can be stubborn, especially when it comes to defending their beliefs or ideas.",
      "4": "Their focus on the bigger picture might make them seem impersonal or uninterested in personal matters or emotions.",
      "5": "Aquarius often challenges traditional norms, which can occasionally lead to conflicts, particularly in more conservative environments."
    },
    "description": "Aquarius is the eleventh sign of the zodiac, symbolized by the Water Bearer. People born between January 20 and February 18 fall under this sign. Aquarius is an Air sign, and it is traditionally ruled by Saturn (traditional ruler) and Uranus (modern ruler), making Aquarius a unique blend of traditionalism and innovation."
  },
  {
    "name": "Capricorn",
    "image": [
      "capricorn-1.jpg",
      "capricorn-2.jpg"
    ],
    "nameLetter": [
      "KH",
      "J"
    ],
    "specialQuality": "Resilient Determination",
    "startDate": "December 22",
    "endDate": "January 19",
    "positives": {
      "1": "Capricorn individuals are highly ambitious. They're driven to succeed and often set high goals for themselves.",
      "2": "Capricorn has a practical and realistic approach to life. They're excellent at making plans and organizing tasks efficiently.",
      "3": "Capricorn possesses a strong sense of discipline and responsibility. They're often reliable and can handle tasks that require commitment.",
      "4": "Capricorn is steadfast and determined. They're willing to put in the hard work necessary to achieve their objectives.",
      "5": "Capricorn individuals are dependable and trustworthy. They take their commitments seriously and follow through on their promises."
    },
    "negatives": {
      "1": "Capricorn individuals can be reserved, making it challenging for them to express their emotions openly. This might sometimes create barriers in relationships.",
      "2": "Their practical nature can sometimes border on pessimism, especially when they focus on potential challenges or obstacles.",
      "3": "Capricorn can be stubborn, especially when they believe their methods or viewpoints are the most effective.",
      "4": "Capricorn's strong work ethic can sometimes lead to overworking, neglecting personal time, or finding it challenging to relax.",
      "5": "Capricorn tends to be cautious, often preferring to stay in their comfort zone rather than taking big risks."
    },
    "description": "Capricorn is the tenth sign of the zodiac, symbolized by the Goat with a fish tail. People born between December 22 and January 19 fall under this sign. Capricorn is an Earth sign, and it is ruled by Saturn, the planet of discipline, responsibility, and structure."
  },
  {
    "name": "Saggitarius",
    "image": [
      "saggitarius-1.jpg",
      "saggitarius-2.jpg"
    ],
    "nameLetter": [
      "BH",
      "F",
      "DH"
    ],
    "specialQuality": "Adventurous Explorer",
    "startDate": "November 22",
    "endDate": "December 21",
    "positives": {
      "1": "Sagittarius individuals have a strong sense of adventure. They love exploring new places, ideas, and experiences.",
      "2": "Sagittarius has a naturally optimistic outlook on life. They see possibilities even in challenging situations and often uplift those around them.",
      "3": "Sagittarius is open to new perspectives and ideas. They enjoy learning from different cultures and are usually non-judgmental.",
      "4": "Many Sagittarians are intellectually inclined. They're curious and enjoy expanding their knowledge through learning and exploration.",
      "5": "Sagittarius values honesty and truth. They're straightforward and often speak their minds, even if it means discussing difficult topics."
    },
    "negatives": {
      "1": "Sagittarius can be impulsive, sometimes making decisions without considering the consequences or thinking things through.",
      "2": "Their love for adventure can sometimes lead to restlessness, making it challenging for them to stay in one place for extended periods.",
      "3": "Sagittarius' honesty can sometimes come across as bluntness. They may unintentionally hurt feelings with their straightforwardness.",
      "4": "Sagittarius individuals might lack patience, especially when dealing with tedious tasks or slow-moving situations.",
      "5": "Due to their desire for freedom, some Sagittarians may struggle with commitment, whether in relationships or long-term projects."
    },
    "description": "Sagittarius is the ninth sign of the zodiac, symbolized by the Archer or Centaur. People born between November 22 and December 21 fall under this sign. Sagittarius is a Fire sign, and it is ruled by Jupiter, the planet of expansion, abundance, and higher knowledge."
  },
  {
    "name": "Scorpio",
    "image": [
      "scorpio-1.jpg",
      "scorpio-2.jpg"
    ],
    "nameLetter": [
      "N",
      "Y"
    ],
    "specialQuality": "Profound Depth",
    "startDate": "October 23",
    "endDate": "November 21",
    "positives": {
      "1": "Scorpio individuals possess an intense and passionate nature. They approach life with a fervor that's hard to match.",
      "2": "Scorpio is highly determined and resilient. When they set their sights on a goal, they're willing to overcome obstacles and challenges to achieve it.",
      "3": "Scorpio is resourceful and can handle complex situations. They're often great problem-solvers and can find creative solutions.",
      "4": "Scorpio has a deep, insightful nature. They're curious about the mysteries of life, constantly seeking to understand the hidden truths.",
      "5": "Scorpio is fiercely loyal to their loved ones. They value strong, lasting relationships and are often the ones you can rely on in times of need."
    },
    "negatives": {
      "1": "Scorpio individuals can be prone to jealousy and possessiveness, especially in relationships where they feel deeply connected.",
      "2": "Scorpio's determination can sometimes border on stubbornness. They may have a hard time letting go of certain viewpoints or grudges.",
      "3": "While their passion is a positive trait, it can sometimes become overwhelming, leading to conflicts or emotional turmoil.",
      "4": "Scorpio can be secretive, often guarding their emotions and thoughts. This secretive nature might lead to misunderstandings or mistrust.",
      "5": "Scorpio might have a desire for control, which can lead to power struggles in relationships or situations."
    },
    "description": "Scorpio is the eighth sign of the zodiac, symbolized by the Scorpion. People born between October 23 and November 21 fall under this sign. Scorpio is a Water sign, and it is ruled by Pluto, the planet associated with transformation, intensity, and depth."
  },
  {
    "name": "Libra",
    "image": [
      "libra-1.jpg",
      "libra-2.jpg"
    ],
    "nameLetter": [
      "R",
      "T"
    ],
    "specialQuality": "Harmony Seeker",
    "startDate": "September 23",
    "endDate": "October 22",
    "positives": {
      "1": "Libra is a natural diplomat. They excel at finding common ground, resolving conflicts, and creating a harmonious atmosphere.",
      "2": "Libra values fairness and justice. They have a strong sense of right and wrong and often champion causes that promote equality.",
      "3": "Libra individuals possess a natural charm and social grace that makes them pleasant to be around. They're excellent at making connections.",
      "4": "Libra thrives in relationships. They're great at building and maintaining connections, valuing companionship and cooperation.",
      "5": "Libra has an eye for beauty and aesthetics. They appreciate art, culture, and the finer things in life."
    },
    "negatives": {
      "1": "Libra's desire for balance and fairness can sometimes lead to indecision, especially when faced with choices that involve complex considerations.",
      "2": "In their efforts to maintain harmony, Libra might have a tendency to please others, even at the expense of their own needs or opinions.",
      "3": "Libra may shy away from conflict, preferring to sweep issues under the rug rather than confront them directly.",
      "4": "While Libra appreciates beauty, they might sometimes come across as superficial, especially if they prioritize appearance over substance.",
      "5": "Libra's strong focus on relationships might lead them to depend on others for validation or decision-making, making them vulnerable to manipulation."
    },
    "description": "Libra is the seventh sign of the zodiac, symbolized by the Scales. People born between September 23 and October 22 fall under this sign. Libra is an Air sign, and it is ruled by Venus, the planet of love, beauty, harmony, and relationships."
  },
  {
    "name": "Virgo",
    "image": [
      "virgo-1.jpg",
      "virgo-2.jpg"
    ],
    "nameLetter": [
      "P",
      "THA"
    ],
    "specialQuality": "Attention to Detail",
    "startDate": "august 23",
    "endDate": "september 22",
    "positives": {
      "1": "Virgo individuals are highly practical and grounded. They have a knack for finding efficient solutions to problems and excel in tasks that require attention to detail.",
      "2": "Virgo's analytical mind allows them to dissect complex issues and find patterns. They're great at critical thinking and often offer valuable insights.",
      "3": "Virgo has a strong work ethic. They're diligent and committed to their tasks, often striving for perfection in their endeavors.",
      "4": "Virgo is known for their reliability. They take their commitments seriously and are usually the ones you can count on to get the job done.",
      "5": "Virgo has a nurturing side and enjoys helping others. They're often the ones offering practical assistance and advice to friends and loved ones."
    },
    "negatives": {
      "1": "Virgo can be overly critical, both of themselves and others. This perfectionist tendency can sometimes lead to unnecessary stress or tension.",
      "2": "Virgo's analytical mind can make them prone to overthinking and worrying about small details, leading to stress or anxiety.",
      "3": "Virgo may become stuck in routines and resistant to change, especially if they believe their methods are the most efficient.",
      "4": "Virgo individuals might have high standards and can sometimes be judgmental if they feel others aren't meeting those standards.",
      "5": "Their strong work ethic can lead to overworking, neglecting self-care, or failing to find a balance between work and relaxation."
    },
    "description": "Virgo is the sixth sign of the zodiac, symbolized by the Virgin. People born between August 23 and September 22 fall under this sign. Virgo is an Earth sign, and it is ruled by Mercury, the planet of communication, intellect, and analysis."
  },
  {
    "name": "Leo",
    "image": [
      "leo-1.webp",
      "leo-2.avif"
    ],
    "nameLetter": [
      "M",
      "TT"
    ],
    "specialQuality": "Magnetic Charisma",
    "startDate": "july 23",
    "endDate": "august 22",
    "positives": {
      "1": "Leo is confident and has a natural air of authority. They often have a strong presence that draws people to them.",
      "2": "Leo individuals have a natural ability to lead. They're charismatic and often take charge in various situations.",
      "3": "Leo is generous, both with their time and resources. They enjoy sharing their successes and making those around them feel special.",
      "4": "Many Leos have a creative streak. They enjoy expressing themselves through various artistic endeavors and often have a flair for drama.",
      "5": "Leo is fiercely loyal to their friends and loved ones. They stand by those they care about, even in challenging times."
    },
    "negatives": {
      "1": "Leo's confidence can sometimes come across as arrogance. They may believe they know what's best, which can be off-putting to others.",
      "2": "Leo can be stubborn, particularly when they believe they're right. They might resist changing their minds or accepting alternative viewpoints.",
      "3": "Leo's desire for recognition can sometimes feed their ego. They may seek validation and admiration from others, which could lead to self-centered behavior.",
      "4": "Leo can act on impulse, which may lead to hasty decisions without thoroughly considering the consequences.",
      "5": "Leo's love for the dramatic can sometimes lead to unnecessary conflicts or attention-seeking behavior."
    },
    "description": "Leo is the fifth sign of the zodiac, symbolized by the Lion. People born between July 23 and August 22 fall under this sign. Leo is a Fire sign, and it is ruled by the Sun, representing qualities such as creativity, passion, and a radiant personality."
  },
  {
    "name": "Cancer",
    "image": [
      "cancer-1.jpg",
      "cancer-2.jpg"
    ],
    "nameLetter": [
      "DD",
      "H"
    ],
    "specialQuality": "Empathetic Nurturer",
    "startDate": "june 21",
    "endDate": "july 22",
    "positives": {
      "1": "Cancer is highly empathetic, able to understand and connect with the emotions of others. They're often compassionate and supportive friends and partners.",
      "2": "Cancer individuals have a strong nurturing nature. They enjoy taking care of loved ones and creating a comfortable, welcoming environment at home.",
      "3": "Cancer is fiercely loyal to their family and close friends. They prioritize strong, lasting relationships and will go to great lengths to protect and support those they care about.",
      "4": "Cancer has a strong intuitive sense, which helps them navigate emotional situations and make decisions based on their gut feelings.",
      "5": "Many Cancer individuals possess a creative streak. They can express themselves artistically, whether through visual arts, music, writing, or other forms of creative expression."
    },
    "negatives": {
      "1": "Cancer individuals can be prone to mood swings. Their emotions can sometimes fluctuate, and they may need time to retreat and process their feelings.",
      "2": "While protective instincts are a positive aspect, Cancer's protectiveness can sometimes become overbearing, leading them to be overly cautious or even smothering.",
      "3": "Cancer's strong attachment to loved ones may lead them to cling onto relationships, making it challenging for others to have personal space.",
      "4": "When faced with conflict or difficult emotions, Cancer individuals might retreat into their shells, avoiding confrontation or suppressing their feelings, which can lead to unresolved issues.",
      "5": "Cancer's tendency to prioritize emotional comfort may lead them to hesitate in making tough decisions, especially if those decisions involve potential emotional upheaval."
    },
    "description": "Cancer is the fourth sign of the zodiac, symbolized by the Crab. People born between June 21 and July 22 fall under this sign. Cancer is a Water sign, and it is ruled by the Moon, which brings a strong connection to emotions, intuition, and nurturing qualities."
  },
  {
    "name": "Gemini",
    "image": [
      "gemini-1.jpg",
      "gemini-2.jpg"
    ],
    "nameLetter": [
      "K",
      "CHH",
      "GH",
      "Q",
      "C"
    ],
    "specialQuality": "Masterful Communicator",
    "startDate": "may 21",
    "endDate": "june 20",
    "positives": {
      "1": "Gemini is highly adaptable and can easily switch between different situations and social circles. They thrive in diverse environments and can connect with people from all walks of life.",
      "2": "Gemini is intellectually curious. They enjoy learning and exploring new ideas, making them great conversationalists and lifelong learners.",
      "3": "Gemini individuals are excellent communicators. They express themselves well, and their engaging conversation style makes them popular among friends and colleagues.",
      "4": "Gemini's versatility allows them to handle multiple tasks and roles effectively. They have a diverse range of interests and can excel in various areas.",
      "5": "Gemini's curiosity drives them to seek out new experiences and knowledge. They have an innate desire to understand the world around them."
    },
    "negatives": {
      "1": "Gemini's ability to see multiple perspectives can lead to indecision. They may struggle to commit to a single choice, constantly weighing pros and cons.",
      "2": "Gemini's love for variety can sometimes make them appear superficial, as they may skim the surface of various topics without delving deep into any one subject.",
      "3": "Gemini individuals can get easily bored if not mentally stimulated. This restlessness may lead them to jump from one activity or interest to another, potentially leaving things unfinished.",
      "4": "Due to their duality, Geminis can be inconsistent in their behaviors and opinions. What they feel or believe one day may change the next.",
      "5": "With many interests, Gemini can sometimes struggle to focus on a single task. This scattered focus might hinder their ability to see projects through to completion."
    },
    "description": "Gemini is the third sign of the zodiac, symbolized by the Twins. People born between May 21 and June 20 fall under this sign. Gemini is an Air sign, and it is ruled by Mercury, the planet of communication, intellect, and versatility."
  },
  {
    "name": "Taurus",
    "image": [
      "taurus-1.jpeg",
      "taurus-2.jpg"
    ],
    "nameLetter": [
      "B",
      "V",
      "U",
      "W"
    ],
    "specialQuality": "Unwavering Determination",
    "startDate": "april 20",
    "endDate": "may 20",
    "positives": {
      "1": "Taurus is dependable and trustworthy, making them great friends and colleagues. They're there for you when you need them, and you can count on them to follow through on their commitments.",
      "2": "Taurus individuals have a sensible approach to life. They're grounded and use common sense to navigate challenges, often making sound decisions.",
      "3": "Taurus is renowned for their patience. They can handle setbacks calmly, which is a valuable trait in both personal and professional situations.",
      "4": "Taurus sets goals and pursues them with unwavering determination. They're willing to put in the hard work necessary to achieve their desires.",
      "5": "Taurus appreciates the physical world, enjoying sensual pleasures like good food, comfortable surroundings, and aesthetic beauty."
    },
    "negatives": {
      "1": "Taurus can be incredibly stubborn. Once they've made up their minds, it's challenging to change their opinion or course of action.",
      "2": "Taurus may resist change, even if it's necessary for growth. This can lead to missed opportunities if they're not open to trying new things.",
      "3": "While valuing possessions and material comfort is not inherently negative, Taurus individuals may become overly focused on material wealth or become possessive.",
      "4": "Their love for sensual pleasures can sometimes lead to overindulgence in food, drink, or other luxuries, potentially leading to health or financial issues.",
      "5": "Taurus' desire for stability can occasionally lead to complacency. They might settle into routines, becoming reluctant to step outside their comfort zones."
    },
    "description": "Taurus is the second sign of the zodiac, symbolized by the Bull. People born between April 20 and May 20 fall under this sign. Taurus is an Earth sign, and it is ruled by Venus, the planet of love, beauty, and harmony. "
  },
  {
    "name": "Aries",
    "image": [
      "aries-1.jpeg",
      "aries-2.jpeg"
    ],
    "nameLetter": [
      "A",
      "L",
      "E",
      "I",
      "O"
    ],
    "specialQuality": "Courageous Pioneer",
    "startDate": "march 21",
    "endDate": "april 20",
    "positives": {
      "1": "Aries are natural leaders. They take charge of situations, inspire others, and have the ability to rally people around a common goal.",
      "2": "Their high energy levels are infectious. Aries bring enthusiasm and excitement to whatever they do, making them great motivators.",
      "3": "Aries faces challenges head-on. Their fearlessness allows them to take risks and tackle difficult situations, inspiring those around them to be brave as well.",
      "4": "Aries' passion is contagious. Whether it's in their work, relationships, or hobbies, they invest themselves wholeheartedly, bringing intensity to every aspect of their lives.",
      "5": "Aries is known for thinking outside the box. They're not afraid to explore new ideas, which often leads to innovative solutions and creative endeavors."
    },
    "negatives": {
      "1": "Aries can act on impulse without thoroughly considering the consequences. This impulsive nature might lead to hasty decisions that they later regret.",
      "2": "Aries individuals often want things to happen quickly, which can lead to frustration when things don't go their way or progress takes longer than expected.",
      "3": "While competition can be positive, excessive competitiveness might strain relationships or lead to conflicts if not tempered with cooperation and consideration for others.",
      "4": "Aries can be quite stubborn, sticking to their opinions and ideas even when faced with valid counterarguments.",
      "5": "Aries' fiery nature can result in a quick temper. They may get easily frustrated or angered, although their anger typically subsides quickly as well."
    },
    "description": "Aries is the first sign of the zodiac, and it is represented by the Ram, symbolizing enthusiasm, energy, and a pioneering spirit. Individuals born between March 21 and April 19 fall under this sign."
  }
]